---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs
source: html/92d224e2-6e12-1202-17a8-4a97b270dcb4.htm
---
# ExternalDataInstanceAddingIntoDocumentEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.